import styles from "../homework001/homework001.module.css"; 


import travelPhoto from './img/travel.jpg'; // = () => { — это стрелочная функция. Стрелочные функции используются для упрощения синтаксиса функций. В данном случае, () => { означает, что функция не принимает никаких аргументов (пустые круглые скобки ()), и тело функции начинается с фигурных скобок {.
//В случае обычной функции используется ключевое слово function, за ним идет имя функции (Homework01), и затем её тело, заключенное в фигурные скобки {}.
function Homework001 () {
  return (
    <div className={styles.card}>
      <img src={travelPhoto} alt="Путешествия" />
      <div className={styles.content}>
        <h2>Моё хобби: Путешествия</h2>
        <p>
          Я обожаю путешествовать! Это позволяет мне открывать новые культуры, пробовать местную кухню и
          знакомиться с удивительными людьми. В этом году мне удалось посетить три замечательные страны:
          Испанию, Францию и Португалию. Каждая поездка была незабываемой!
        </p>
      </div>
    </div>
  );
};

export default Homework001;